sysbench/oltp_read_only_baseline.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 32 tps: 332.90 qps: 5349.02 (r/w/o: 4680.02/0.00/669.00) lat (ms,99%): 125.52 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 32 tps: 321.61 qps: 5147.77 (r/w/o: 4504.85/0.00/642.92) lat (ms,99%): 130.13 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 32 tps: 316.52 qps: 5069.28 (r/w/o: 4436.03/0.00/633.25) lat (ms,99%): 127.81 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 32 tps: 319.49 qps: 5109.33 (r/w/o: 4470.25/0.00/639.08) lat (ms,99%): 127.81 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 32 tps: 314.39 qps: 5028.87 (r/w/o: 4400.40/0.00/628.47) lat (ms,99%): 134.90 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 32 tps: 311.10 qps: 4980.05 (r/w/o: 4357.75/0.00/622.29) lat (ms,99%): 134.90 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 32 tps: 312.51 qps: 4992.53 (r/w/o: 4367.40/0.00/625.13) lat (ms,99%): 132.49 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 32 tps: 312.01 qps: 4996.69 (r/w/o: 4372.68/0.00/624.01) lat (ms,99%): 134.90 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 32 tps: 307.88 qps: 4925.47 (r/w/o: 4309.61/0.00/615.86) lat (ms,99%): 137.35 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 32 tps: 308.62 qps: 4938.96 (r/w/o: 4321.71/0.00/617.24) lat (ms,99%): 137.35 err/s: 0.00 reconn/s: 0.00
Latency histogram (values are in milliseconds)
       value  ------------- distribution ------------- count
      55.824 |                                         1
      66.838 |                                         2
      69.289 |                                         4
      70.548 |                                         2
      71.830 |                                         9
      73.135 |                                         14
      74.464 |                                         23
      75.817 |*                                        45
      77.194 |*                                        76
      78.597 |***                                      140
      80.025 |****                                     195
      81.479 |*****                                    270
      82.959 |*******                                  389
      84.467 |**********                               545
      86.002 |************                             680
      87.564 |*****************                        912
      89.155 |********************                     1077
      90.775 |**************************               1407
      92.424 |*****************************            1608
      94.104 |**********************************       1877
      95.814 |*************************************    2022
      97.555 |**************************************   2077
      99.327 |***************************************  2146
     101.132 |**************************************** 2186
     102.969 |***************************************  2146
     104.840 |*************************************    2022
     106.745 |*********************************        1792
     108.685 |*****************************            1572
     110.659 |*************************                1372
     112.670 |********************                     1103
     114.717 |*****************                        906
     116.802 |*************                            704
     118.924 |**********                               566
     121.085 |********                                 437
     123.285 |******                                   336
     125.525 |*****                                    255
     127.805 |***                                      177
     130.128 |**                                       134
     132.492 |**                                       86
     134.899 |*                                        79
     137.350 |*                                        52
     139.846 |*                                        41
     142.387 |*                                        38
     144.974 |                                         16
     147.608 |                                         23
     150.290 |                                         14
     153.021 |                                         4
     155.801 |                                         8
     158.632 |                                         3
     161.514 |                                         3
     164.449 |                                         3
     167.437 |                                         2
     173.577 |                                         1
     176.731 |                                         1
 
SQL statistics:
    queries performed:
        read:                            442442
        write:                           0
        other:                           63206
        total:                           505648
    transactions:                        31603  (315.74 per sec.)
    queries:                             505648 (5051.92 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          100.0888s
    total number of events:              31603

Latency (ms):
         min:                                   55.76
         avg:                                  101.30
         max:                                  177.68
         99th percentile:                      132.49
         sum:                              3201244.80

Threads fairness:
    events (avg/stddev):           987.5938/2.67
    execution time (avg/stddev):   100.0389/0.03