sysbench/oltp_read_only_flexible.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 32 tps: 333.02 qps: 5355.23 (r/w/o: 4686.00/0.00/669.23) lat (ms,99%): 121.08 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 32 tps: 324.10 qps: 5185.28 (r/w/o: 4537.27/0.00/648.01) lat (ms,99%): 121.08 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 32 tps: 316.30 qps: 5056.77 (r/w/o: 4424.17/0.00/632.60) lat (ms,99%): 125.52 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 32 tps: 318.18 qps: 5094.72 (r/w/o: 4458.15/0.00/636.56) lat (ms,99%): 125.52 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 32 tps: 318.01 qps: 5084.57 (r/w/o: 4448.75/0.00/635.82) lat (ms,99%): 125.52 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 32 tps: 318.20 qps: 5095.86 (r/w/o: 4459.37/0.00/636.50) lat (ms,99%): 125.52 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 32 tps: 317.59 qps: 5083.19 (r/w/o: 4448.11/0.00/635.07) lat (ms,99%): 125.52 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 32 tps: 312.56 qps: 5000.89 (r/w/o: 4375.77/0.00/625.12) lat (ms,99%): 132.49 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 32 tps: 304.84 qps: 4875.16 (r/w/o: 4265.38/0.00/609.78) lat (ms,99%): 132.49 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 32 tps: 313.11 qps: 5011.09 (r/w/o: 4384.98/0.00/626.11) lat (ms,99%): 147.61 err/s: 0.00 reconn/s: 0.00
Latency histogram (values are in milliseconds)
       value  ------------- distribution ------------- count
      63.323 |                                         1
      68.053 |                                         1
      71.830 |                                         6
      73.135 |                                         9
      74.464 |                                         22
      75.817 |                                         19
      77.194 |*                                        52
      78.597 |*                                        65
      80.025 |***                                      152
      81.479 |****                                     230
      82.959 |******                                   330
      84.467 |*********                                528
      86.002 |************                             705
      87.564 |***************                          893
      89.155 |********************                     1146
      90.775 |*************************                1473
      92.424 |*******************************          1797
      94.104 |***********************************      2045
      95.814 |*************************************    2155
      97.555 |***************************************  2281
      99.327 |***************************************  2299
     101.132 |**************************************** 2341
     102.969 |***************************************  2286
     104.840 |**********************************       1995
     106.745 |********************************         1887
     108.685 |***************************              1571
     110.659 |***********************                  1323
     112.670 |*******************                      1114
     114.717 |*************                            782
     116.802 |***********                              636
     118.924 |*********                                509
     121.085 |******                                   344
     123.285 |****                                     223
     125.525 |***                                      173
     127.805 |**                                       131
     130.128 |*                                        72
     132.492 |*                                        47
     134.899 |*                                        35
     137.350 |                                         29
     139.846 |                                         20
     142.387 |                                         17
     144.974 |                                         12
     147.608 |                                         5
     150.290 |                                         2
     153.021 |                                         5
     155.801 |                                         2
     158.632 |                                         1
     161.514 |                                         5
     164.449 |                                         4
     167.437 |                                         1
     170.479 |                                         2
     173.577 |                                         4
     176.731 |                                         1
     179.942 |                                         1
     183.211 |                                         1
     189.929 |                                         1
 
SQL statistics:
    queries performed:
        read:                            445074
        write:                           0
        other:                           63582
        total:                           508656
    transactions:                        31791  (317.63 per sec.)
    queries:                             508656 (5082.08 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          100.0867s
    total number of events:              31791

Latency (ms):
         min:                                   63.05
         avg:                                  100.70
         max:                                  188.74
         99th percentile:                      127.81
         sum:                              3201249.24

Threads fairness:
    events (avg/stddev):           993.4688/3.12
    execution time (avg/stddev):   100.0390/0.02